"""
Δίνονται πραγματικοί αριθμοί με δύο τρόπους:
- είτε είναι γνωστό το πλήθος τους N και οι αριθμοί ακολουθούν
- είτε διαβάζονται μέχρι να τελειώσουν, για παράδειγμα μέσω ενός «μη αριθμού».
Να γραφούν δύο προγράμματα Η/Υ ένα για κάθε μία από τις δύο προηγούμενες προδιαγραφές εισόδου και
χωρίς την χρήση συναρτήσεων / ειδικών εντολών / πινάκων / λιστών ή άλλης έτοιμης ειδικής
τεχνικής να υπολογίζουν και εμφανίζουν...
1. ...το πλήθος των αριθμών
2. ...τον ελάχιστο και την σειρά που εμφανίστηκε πρώτα
3. ...τον μέγιστο και την σειρά που εμφανίστηκε τελευταία
4. ...τον μέσο όρο τους
5. ...τον διάμεσό τους ( αδύνατο χωρίς την χρήση λίστας :-( )
6. ...την διασπορά και την τυπική απόκλιση.
"""
# Λύση 2ου Προγράμματος (β):
