"""
Δίνεται κείμενο σε λατινικούς χαρακτήρες ascii. Να γραφούν προγράμματα κωδικοποίησης και
αποκωδικοποίησης με την μέθοδο Καίσαρα: μετακίνηση Ν χαρακτήρων στο αλφάβητο πχ A--->C
και το Z--->B για Ν=+2. Το πρόγραμμα κωδικοποίησης θα αγνοεί τους κενούς χαρακτήρες ενώ θα
μετατρέπει το κείμενο σε κεφαλαία. Επίσης να γραφτεί πρόγραμμα το οποίο δεδομένης λέξης στο
αυθεντικό κείμενο θα βρίσκει τον Ν σε κωδικοποιημένη έκδοσή του (χωρίς την χρήση
συναρτήσεων / ειδικών εντολών / πινάκων / λιστών ή άλλης έτοιμης ειδικής τεχνικής).
"""
# Λύση:
