"""
Να λυθούν τα προβλήματα της εμπροσθοτομίας και της οπισθοτομίας σύμφωνα με τις ακόλουθες
εφαρμογές:

(1) Δίνονται Ν σημεία στο επίπεδο από τα οποία έχουν μετρηθεί οι αποστάσεις προς τριγωνομετρικά.
Να γραφεί πρόγραμμα το οποίο να ταξινομεί τις μετρήσεις ανά τριγωνομετρικό και να υπολογίζει
την θέση του.

(2) Δίδονται τα τριγωνομετρικά Τ (θέσεις στον χώρο) και μετρήσεις προς σημεία Κ του επιπέδου. Οι
μετρήσεις περιλαμβάνουν αποστάσεις (οριζόντιες ή κεκλιμένες), οριζόντιες ή/και κατακόρυφες
γωνίες. Να υπολογιστούν οι συντεταγμένες των σημείων του επιπέδου.
"""
# Λύση (2):
